ListAnswersResponse(WorkloadId = 8389f11a0f3863859e668e07741adef1, LensAlias = wellarchitected, LensArn = arn: aws: wellarchitected::aws: lens / wellarchitected, AnswerSummaries = [AnswerSummary(QuestionId = cloud - financial - management, PillarId = costOptimization, QuestionTitle = How do you implement cloud financial management ? , Choices = [Choice(ChoiceId = cost_cloud_financial_management_function, Title = Establish a cost optimization
function, Description = Create a team(Cloud Business Office or Cloud Center of Excellence) that is responsible
for establishing and maintaining cost awareness across your organization.The team requires people from finance, technology, and business roles across the organization.), Choice(ChoiceId = cost_cloud_financial_management_partnership, Title = Establish a partnership between finance and technology, Description = Involve finance and technology teams in cost and usage discussions at all stages of your cloud journey.Teams regularly meet and discuss topics such as organizational goals and targets, current state of cost and usage, and financial and accounting practices.), Choice(ChoiceId = cost_cloud_financial_management_budget_forecast, Title = Establish cloud budgets and forecasts, Description = Adjust existing organizational budgeting and forecasting processes to be compatible with the highly variable nature of cloud costs and usage.Processes must be dynamic using trend - based or business driver - based algorithms, or a combination of both.), Choice(ChoiceId = cost_cloud_financial_management_cost_awareness, Title = Implement cost awareness in your organizational processes, Description = Implement cost awareness into new or existing processes that impact usage, and leverage existing processes
for cost awareness.Implement cost awareness into employee training.), Choice(ChoiceId = cost_cloud_financial_management_usage_report, Title = Report and notify on cost optimization, Description = Configure AWS Budgets and AWS Cost Anomaly Detection to provide notifications on cost and usage against targets.Have regular meetings to analyze your workload 's cost efficiency and to promote cost-aware culture.), Choice(ChoiceId=cost_cloud_financial_management_culture, Title=Create a cost-aware culture, Description= Implement changes or programs across your organization to create a cost-aware culture. It is recommended to start small, then as your capabilities increase and your organization’s use of the cloud increases, implement large and wide ranging programs. ), Choice(ChoiceId=cost_cloud_financial_management_proactive_process, Title=Monitor cost proactively, Description=Implement tooling and dashboards to monitor cost proactively for the workload. Regularly review the costs with configured tools or out of the box tools, do not just look at costs and categories when you receive notifications. Monitoring and analyzing costs proactively helps to identify positive trends and allows you to promote them throughout your organization.), Choice(ChoiceId=cost_cloud_financial_management_scheduled, Title=Keep up to date with new service releases, Description=Consult regularly with experts or APN Partners to consider which services and features provide lower cost. Review AWS blogs and other information sources. ), Choice(ChoiceId=cost_cloud_financial_management_quantify_value, Title=Quantify business value from cost optimization, Description=Quantifying business value from cost optimization allows you to understand the entire set of benefits to your organization. Because cost optimization is a necessary investment, quantifying business value allows you to explain the return on investment to stakeholders. Quantifying business value can help you gain more buy-in from stakeholders on future cost optimization investments, and provides a framework to measure the outcomes for your organization’s cost optimization activities. ), Choice(ChoiceId=cost_cloud_financial_management_no, Title=None of these, Description=)], SelectedChoices=[], ChoiceAnswerSummaries=[], IsApplicable=true, Risk=UNANSWERED), AnswerSummary(QuestionId=govern-usage, PillarId=costOptimization, QuestionTitle=How do you govern usage?, Choices=[Choice(ChoiceId=cost_govern_usage_policies, Title=Develop policies based on your organization requirements, Description=Develop policies that define how resources are managed by your organization. Policies should cover cost aspects of resources and workloads, including creation, modification, and decommission over the resource lifetime. ), Choice(ChoiceId=cost_govern_usage_goal_target, Title=Implement goals and targets, Description=Implement both cost and usage goals and targets for your workload. Goals provide direction to your organization on expected outcomes, and targets provide specific measurable outcomes to be achieved for your workloads. ), Choice(ChoiceId=cost_govern_usage_account_structure, Title=Implement an account structure, Description=Implement a structure of accounts that maps to your organization. This assists in allocating and managing costs throughout your organization.), Choice(ChoiceId=cost_govern_usage_track_lifecycle, Title=Track project lifecycle, Description=Track, measure, and audit the lifecycle of projects, teams, and environments to avoid using and paying for unnecessary resources.), Choice(ChoiceId=cost_govern_usage_groups_roles, Title=Implement groups and roles, Description=Implement groups and roles that align to your policies and control who can create, modify, or decommission instances and resources in each group. For example, implement development, test, and production groups. This applies to AWS services and third-party solutions.), Choice(ChoiceId=cost_govern_usage_controls, Title=Implement cost controls, Description=Implement controls based on organization policies and defined groups and roles. These certify that costs are only incurred as defined by organization requirements such as control access to regions or resource types. ), Choice(ChoiceId=cost_govern_usage_no, Title=None of these, Description=)], SelectedChoices=[], ChoiceAnswerSummaries=[], IsApplicable=true, Risk=UNANSWERED), AnswerSummary(QuestionId=monitor-usage, PillarId=costOptimization, QuestionTitle=How do you monitor usage and cost?, Choices=[Choice(ChoiceId=cost_monitor_usage_detailed_source, Title=Configure detailed information sources, Description=Configure the AWS Cost and Usage Report, and Cost Explorer hourly granularity, to provide detailed cost and usage information. Configure your workload to have log entries for every delivered business outcome.), Choice(ChoiceId=cost_monitor_usage_define_attribution, Title=Identify cost attribution categories, Description=Identify organization categories that could be used to allocate cost within your organization.), Choice(ChoiceId=cost_monitor_usage_define_kpi, Title=Establish organization metrics, Description=Establish the organization metrics that are required for this workload. Example metrics of a workload are customer reports produced or web pages served to customers.), Choice(ChoiceId=cost_monitor_usage_config_tools, Title=Configure billing and cost management tools, Description=Configure cost management tools in line with your organization policies to manage and optimize cloud spend. This includes services, tools, and resources to organize and track cost and usage data, enhance control through consolidated billing and access permission, improve planning through budgeting and forecasts, receive notifications or alerts, and further lower cost with resources and pricing optimizations. ), Choice(ChoiceId=cost_monitor_usage_allocate_outcome, Title=Allocate costs based on workload metrics, Description=Allocate the workload'
s costs by metrics or business outcomes to measure workload cost efficiency.Implement a process to analyze the AWS Cost and Usage Report with Amazon Athena, which can provide insight and charge back capability.), Choice(ChoiceId = cost_monitor_usage_org_information, Title = Add organization information to cost and usage, Description = Define a tagging schema based on your organization, workload attributes, and cost allocation categories so that you can filter and search
for resources or monitor cost and usage in cost management tools.Implement consistent tagging across all resources where possible by purpose, team, environment, or other criteria relevant to your business.), Choice(ChoiceId = cost_monitor_usage_no, Title = None of these, Description = )], SelectedChoices = [], ChoiceAnswerSummaries = [], IsApplicable = true, Risk = UNANSWERED), AnswerSummary(QuestionId = decomissioning - resources, PillarId = costOptimization, QuestionTitle = How do you decommission resources ? , Choices = [Choice(ChoiceId = cost_decomissioning_resources_track, Title = Track resources over their life time, Description = Define and implement a method to track resources and their associations with systems over their life time.You can use tagging to identify the workload or
function of the resource.), Choice(ChoiceId = cost_decomissioning_resources_implement_process, Title = Implement a decommissioning process, Description = Implement a process to identify and decommission unused resources.), Choice(ChoiceId = cost_decomissioning_resources_decomm_automated, Title = Decommission resources automatically, Description = Design your workload to gracefully handle resource termination as you identify and decommission non - critical resources, resources that are not required, or resources with low utilization.), Choice(ChoiceId = cost_decomissioning_resources_decommission, Title = Decommission resources, Description = Decommission resources triggered by events such as periodic audits or changes in usage.Decommissioning is typically performed periodically, and can be manual or automated.), Choice(ChoiceId = cost_decomissioning_resources_data_retention, Title = Enforce data retention policies, Description = Define data retention policies on supported resources to handle object deletion per your organizations’ requirements.Identify and delete unnecessary or orphaned resources and objects that are no longer required.), Choice(ChoiceId = cost_decomissioning_resources_no, Title = None of these, Description = )], SelectedChoices = [], ChoiceAnswerSummaries = [], IsApplicable = true, Risk = UNANSWERED), AnswerSummary(QuestionId = select - service, PillarId = costOptimization, QuestionTitle = How do you evaluate cost when you select services ? , Choices = [Choice(ChoiceId = cost_select_service_requirements, Title = Identify organization requirements
for cost, Description = Work with team members to define the balance between cost optimization and other pillars, such as performance and reliability,
for this workload.), Choice(ChoiceId = cost_select_service_analyze_all, Title = Analyze all components of this workload, Description = Verify every workload component is analyzed, regardless of current size or current costs.The review effort should reflect the potential benefit, such as current and projected costs.), Choice(ChoiceId = cost_select_service_thorough_analysis, Title = Perform a thorough analysis of each component, Description = Look at overall cost to the organization of each component.Calculate the total cost of ownership by factoring in cost of operations and management, especially when using managed services by cloud provider.The review effort should reflect potential benefit(
for example, time spent analyzing is proportional to component cost).), Choice(ChoiceId = cost_select_service_licensing, Title = Select software with cost effective licensing, Description = Open source software will eliminate software licensing costs, which can contribute significant costs to workloads.Where licensed software is required, avoid licenses bound to arbitrary attributes such as CPUs, look
for licenses that are bound to output or outcomes.The cost of these licenses scales more closely to the benefit they provide.), Choice(ChoiceId = cost_select_service_select_for_cost, Title = Select components of this workload to optimize cost in line with organization priorities, Description = Factor in cost when selecting all components
for your workload.This includes using application level and managed services or serverless, containers, or event - driven architecture to reduce overall cost.Minimize license costs by using open - source software, software that does not have license fees, or alternatives to reduce the cost.), Choice(ChoiceId = cost_select_service_analyze_over_time, Title = Perform cost analysis
for different usage over time, Description = Workloads can change over time.Some services or features are more cost effective at different usage levels.By performing the analysis on each component over time and at projected usage, you ensure the workload remains cost - effective over its lifetime.), Choice(ChoiceId = cost_select_service_no, Title = None of these, Description = )], SelectedChoices = [], ChoiceAnswerSummaries = [], IsApplicable = true, Risk = UNANSWERED), AnswerSummary(QuestionId = type - size - number - resources, PillarId = costOptimization, QuestionTitle = How do you meet cost targets when you select resource type, size and number ? , Choices = [Choice(ChoiceId = cost_type_size_number_resources_cost_modeling, Title = Perform cost modeling, Description = Identify organization requirements(such as business needs and existing commitments) and perform cost modeling(overall costs) of the workload and each of its components.Perform benchmark activities
for the workload under different predicted loads and compare the costs.The modeling effort should reflect the potential benefit.For example, time spent is proportional to component cost.), Choice(ChoiceId = cost_type_size_number_resources_data, Title = Select resource type, size, and number based on data, Description = Select resource size or type based on data about the workload and resource characteristics.For example, compute, memory, throughput, or write intensive.This selection is typically made using a previous(on - premises) version of the workload, using documentation, or using other sources of information about the workload.), Choice(ChoiceId = cost_type_size_number_resources_metrics, Title = Select resource type, size, and number automatically based on metrics, Description = Use metrics from the currently running workload to select the right size and type to optimize
for cost.Appropriately provision throughput, sizing, and storage
for compute, storage, data, and networking services.This can be done with a feedback loop such as automatic scaling or by custom code in the workload.), Choice(ChoiceId = cost_type_size_number_resources_no, Title = None of these, Description = )], SelectedChoices = [], ChoiceAnswerSummaries = [], IsApplicable = true, Risk = UNANSWERED), AnswerSummary(QuestionId = pricing - model, PillarId = costOptimization, QuestionTitle = How do you use pricing models to reduce cost ? , Choices = [Choice(ChoiceId = cost_pricing_model_analysis, Title = Perform pricing model analysis, Description = Analyze each component of the workload.Determine
if the component and resources will be running
for extended periods(
for commitment discounts) or dynamic and short - running(
for spot or on - demand).Perform an analysis on the workload using the recommendations in cost management tools and apply business rules to those recommendations to achieve high returns.), Choice(ChoiceId = cost_pricing_model_implement_models, Title = Implement pricing models
for all components of this workload, Description = Permanently running resources should utilize reserved capacity such as Savings Plans or Reserved Instances.Short - term capacity is configured to use Spot Instances, or Spot Fleet.On - Demand Instances are only used
for short - term workloads that cannot be interrupted and do not run long enough
for
reserved capacity, between 25 % to 75 % of the period, depending on the resource type.), Choice(ChoiceId = cost_pricing_model_master_analysis, Title = Perform pricing model analysis at the master account level, Description = Check billing and cost management tools and see recommended discounts with commitments and reservations to perform regular analysis at the management account level.), Choice(ChoiceId = cost_pricing_model_region_cost, Title = Implement Regions based on cost, Description = Resource pricing may be different in each Region.Identify regional cost differences and only deploy in Regions with higher costs to meet latency and data sovereignty requirements.Factoring in Region cost helps you pay the lowest overall price
for this workload.), Choice(ChoiceId = cost_pricing_model_third_party, Title = Select third party agreements with cost efficient terms, Description = Cost efficient agreements and terms ensure the cost of these services scales with the benefits they provide.Select agreements and pricing that scale when they provide additional benefits to your organization.), Choice(ChoiceId = cost_pricing_model_no, Title = None of these, Description = )], SelectedChoices = [], ChoiceAnswerSummaries = [], IsApplicable = true, Risk = UNANSWERED), AnswerSummary(QuestionId = data - transfer, PillarId = costOptimization, QuestionTitle = How do you plan
for
data transfer charges ? , Choices = [Choice(ChoiceId = cost_data_transfer_modeling, Title = Perform data transfer modeling, Description = Gather organization requirements and perform data transfer modeling of the workload and each of its components.This identifies the lowest cost point
for its current data transfer requirements.), Choice(ChoiceId = cost_data_transfer_optimized_components, Title = Select components to optimize data transfer cost, Description = All components are selected, and architecture is designed to reduce data transfer costs.This includes using components such as wide - area - network(WAN) optimization and Multi - Availability Zone(AZ) configurations), Choice(ChoiceId = cost_data_transfer_implement_services, Title = Implement services to reduce data transfer costs, Description = Implement services to reduce data transfer.For example, using a content delivery network(CDN) such as Amazon CloudFront to deliver content to end users, caching layers using Amazon ElastiCache, or using AWS Direct Connect instead of VPN
for connectivity to AWS.), Choice(ChoiceId = cost_data_transfer_no, Title = None of these, Description = )], SelectedChoices = [], ChoiceAnswerSummaries = [], IsApplicable = true, Risk = UNANSWERED), AnswerSummary(QuestionId = manage - demand - resources, PillarId = costOptimization, QuestionTitle = How do you manage demand, and supply resources ? , Choices = [Choice(ChoiceId = cost_manage_demand_resources_cost_analysis, Title = Perform an analysis on the workload demand, Description = Analyze the demand of the workload over time.Verify that the analysis covers seasonal trends and accurately represents operating conditions over the full workload lifetime.Analysis effort should reflect potential benefit,
for example, time spent is proportional to the workload cost.), Choice(ChoiceId = cost_manage_demand_resources_dynamic, Title = Supply resources dynamically, Description = Resources are provisioned in a planned manner.This can be demand - based, such as through automatic scaling, or time - based, where demand is predictable and resources are provided based on time.These methods result in the least amount of over or under - provisioning.), Choice(ChoiceId = cost_manage_demand_resources_buffer_throttle, Title = Implement a buffer or throttle to manage demand, Description = Buffering and throttling modify the demand on your workload, smoothing out any peaks.Implement throttling when your clients perform retries.Implement buffering to store the request and defer processing until a later time.Verify that your throttles and buffers are designed so clients receive a response in the required time.), Choice(ChoiceId = cost_manage_demand_resources_no, Title = None of these, Description = )], SelectedChoices = [], ChoiceAnswerSummaries = [], IsApplicable = true, Risk = UNANSWERED), AnswerSummary(QuestionId = evaluate - new - services, PillarId = costOptimization, QuestionTitle = How do you evaluate new services ? , Choices = [Choice(ChoiceId = cost_evaluate_new_services_review_process, Title = Develop a workload review process, Description = Develop a process that defines the criteria and process
for workload review.The review effort should reflect potential benefit.For example, core workloads or workloads with a value of over ten percent of the bill are reviewed quarterly or every six months,
while workloads below ten percent are reviewed annually.), Choice(ChoiceId = cost_evaluate_new_services_review_workload, Title = Review and analyze this workload regularly, Description = Existing workloads are regularly reviewed based on each defined process to find out
if new services can be adopted, existing services can be replaced, or workloads can be re - architected.), Choice(ChoiceId = cost_evaluate_new_services_no, Title = None of these, Description = )], SelectedChoices = [], ChoiceAnswerSummaries = [], IsApplicable = true, Risk = UNANSWERED)], NextToken = Ka9qeIy8WcVDfTPlUp / wxAalpqJzeGW6ghNAhvAJpRbH2AIx0cAaZlSdeT + WmhW8AOTQ6pwMtXNSxDw2DbooxYL / qmumlu7 + UAy97IyER9AlSWSEH2XCTkRBo / 2 i + Otx8evI / OnFxY6peESXS / 0 hgxKwQo71 / FAC0ZoReJLwNtvtPepQUqC06Eul7sOYQaHF2nxITJBQteayHLbeuvhjV94KtX1F38vSOsXIloIjew8SJ1Nq9w5ShZ3gbAHPk7r87qq1FEe4WOSa7zQDlH1TqQlknyGZ + ar4Qg9BNrva / Ac = )